app/controllers/tasks_controller.rb

def list
	if params[:user_id] != ""
		@user = User.find(:first, :conditions=> ["id=?", params[:user_id]])
	else
		@user = session[:current_user]
	end
	@tasks = Task.find(:all, :conditions=> ["createdby in (?)", @user.id])
---
SELECT * FROM `users` WHERE (id='2') LIMIT 1
SELECT * FROM `tasks` WHERE (createdby in (NULL))