app/controllers/welcome_controller.rb

SELECT * FROM `users` WHERE (name='asdsad' and password='asdasd') LIMIT 1
SELECT * FROM `roles` WHERE (id=1) LIMIT 1
---
def verifylogin
@user = User.find(:first, :conditions => ["name=? and password=?", params[:username], params[:password]])
if @user
session[:current_user] = @user
@role = Role.find(:first, :conditions => ["id=?", @user.role_id])